app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save